// JavaScript Document

/*人事报表——年龄报表*/
$(document).ready(function () {
	$('.jqChart').jqChart({
		title: { text: '柱形图示例' },
		axes: [
			{
				location: 'left',//y轴位置，取值：left,right
				minimum: 10,//y轴刻度最小值
				maximum: 100,//y轴刻度最大值
				interval: 10//刻度间距
			}
		],
		series: [
			//数据1开始
			{
				type: 'column',//图表类型，取值：column 柱形图，line 线形图
				title:'北京',//标题
				data: [['一月', 70], ['二月', 40], ['三月', 55], ['四月', 50], ['五月', 60], ['六月', 40]]//数据内容，格式[[x轴标题,数值1],[x轴标题,数值2],......]
			},
			//数据1结束
			//数据2
			{
				type: 'column',
				title:'上海',
				data: [['一月', 40], ['二月', 50], ['三月', 95], ['四月', 55], ['五月', 25], ['六月', 45]]
			},
			//数据2结束
			//数据3
			{
			type: 'column',
			title:'广州',
			data: [['一月', 70], ['二月', 40], ['三月', 55], ['四月', 50], ['五月', 45], ['六月', 80]]
			},
			//数据3结束			
		]
	});
});
/*人事报表—年龄报表*/